<template>
  <div id="main2"></div>
</template>

<script>
let myChart
export default {
  name: 'Echarts',
  data() {
    return {
      data: {},
      articlecout: {
        datax: [],
        datay: [],
      },
    }
  },
  mounted() {
    this.myEcharts()
  },
  methods: {
    myEcharts() {
      if (myChart != null && myChart != '' && myChart != undefined) {
        myChart.dispose()
      }
      const data1 = [
        [
          0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 1,
          0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 1, 1,
        ],
        [
          0, 0, 1, 0, 0, 1, 1, 1, 10, 7, 1, 1, 2, 1, 4, 1, 2, 2, 6, 7, 5, 33, 38, 47, 38, 41, 43,
          32, 35, 68, 91, 64, 34, 47, 71, 84, 68, 46, 92, 89, 68, 56, 122, 28,
        ],
        [
          0, 0, 1, 0, 0, 0, 0, 1, 3, 2, 3, 3, 0, 2, 2, 0, 2, 0, 4, 4, 2, 1, 6, 1, 2, 3, 0, 1, 1, 3,
          1, 1, 2, 2, 6, 11, 1, 2, 2, 3, 0, 3, 3, 0,
        ],
        [
          0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 1, 0, 1, 1, 2, 2, 2, 5, 6, 11, 6, 31, 40, 28, 17,
          22, 11, 35, 23, 13, 12, 6, 16, 13, 20, 37, 69, 30, 19, 22, 16,
        ],
        [
          0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 3, 1, 0, 1, 4, 9, 20, 15, 2, 7, 4, 2, 7, 4, 4, 6, 4, 1, 8,
          3, 4, 3, 5, 2, 1, 1, 1, 3, 0, 1, 3, 1, 8, 1,
        ],
        [
          0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0,
          0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        ],
        [
          0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 2, 0, 2, 2, 2, 5, 4, 3, 5, 1, 1, 4, 7,
          4, 1, 8, 7, 3, 2, 3, 0, 6, 2, 0, 1, 18, 6,
        ],
        [
          0, 0, 0, 0, 0, 0, 1, 1, 2, 1, 1, 2, 2, 5, 3, 5, 14, 9, 6, 15, 12, 28, 95, 66, 62, 72, 52,
          96, 92, 93, 93, 161, 220, 112, 49, 50, 37, 38, 32, 34, 10, 4, 17, 3,
        ],
        [
          0, 0, 0, 0, 0, 0, 3, 8, 5, 2, 3, 4, 5, 2, 3, 3, 7, 13, 2, 1, 3, 6, 28, 23, 28, 24, 21, 34,
          34, 38, 181, 156, 152, 191, 86, 32, 21, 2, 13, 55, 15, 8, 22, 5,
        ],
        [
          0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 6, 1, 3, 2, 7, 1, 1, 4,
          1, 0, 0, 0, 0, 0, 1, 2, 2, 2, 0, 1, 1, 0,
        ],
        [
          2, 2, 0, 0, 0, 1, 3, 5, 8, 12, 11, 3, 8, 16, 21, 83, 45, 44, 22, 32, 26, 48, 208, 151,
          178, 183, 182, 149, 88, 89, 81, 64, 98, 100, 112, 161, 145, 157, 122, 92, 32, 46, 86, 35,
        ],
        [
          0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 5, 1, 1, 0, 0, 0, 3, 2, 3, 2, 5, 3, 14, 7, 19, 7, 4, 2, 2,
          1, 4, 5, 3, 7, 8, 6, 1, 2, 3, 2, 1, 4, 9, 1,
        ],
        [
          0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
          0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        ],
        [
          0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0,
          0, 0, 0, 0, 0, 0, 0, 2, 1, 2, 0, 0, 0, 0,
        ],
        [
          0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0,
          0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        ],
        [
          0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 3, 0, 5, 6, 4, 8, 10, 6,
          5, 12, 10, 3, 3, 4, 0, 0, 11, 2, 2, 8, 7, 7,
        ],
      ]
      const data11 = [
        2, 2, 2, 1, 0, 2, 8, 17, 29, 24, 28, 17, 21, 28, 37, 102, 94, 90, 48, 73, 67, 133, 424, 311,
        374, 390, 346, 342, 298, 324, 500, 491, 545, 483, 345, 367, 291, 275, 321, 354, 162, 153,
        316, 103,
      ]
      // 基于准备好的dom，初始化echarts实例
      myChart = this.$echarts.init(document.getElementById('main2'))
      // 指定图表的配置项和数据
      let option = {
        tooltip: {
          trigger: 'axis',
        },
        title: {
          text: '不同区域数量对比',
          textStyle: {
            fontWeight: '800', //标题颜色
            color: '#fff',
          },
          x: 'center',
        },
        grid: {
          left: '0',
          right: '1%',
          bottom: '3%',
          top: '8%',
          containLabel: true,
        },
        toolbox: {
          feature: {
            saveAsImage: {},
          },
        },
        xAxis: {
          type: 'category',
          boundaryGap: false,
          splitLine: {
            show: false,
          },
          axisLabel: {
            show: true,
            textStyle: {
              color: '#fff', //更改坐标轴文字颜色
            },
          },
          data: [
            '1978',
            '1979',
            '1980',
            '1981',
            '1982',
            '1983',
            '1984',
            '1985',
            '1986',
            '1987',
            '1988',
            '1989',
            '1990',
            '1991',
            '1992',
            '1993',
            '1994',
            '1995',
            '1996',
            '1997',
            '1998',
            '1999',
            '2000',
            '2001',
            '2002',
            '2003',
            '2004',
            '2005',
            '2006',
            '2007',
            '2008',
            '2009',
            '2010',
            '2011',
            '2012',
            '2013',
            '2014',
            '2015',
            '2016',
            '2017',
            '2018',
            '2019',
            '2020',
            '2021',
          ],
        },
        yAxis: {
          type: 'value',
          splitLine: {
            show: false,
          },
          axisLabel: {
            show: true,
            textStyle: {
              color: '#fff', //更改坐标轴文字颜色
            },
          },
        },
        color: [
          '#7cb5ec',
          '#434348',
          '#90ed7d',
          '#f7a35c',
          '#8085e9',
          '#f15c80',
          '#e4d354',
          '#2b908f',
          '#f45b5b',
          '#AA4643',
          '#89A54E',
          '#80699B',
        ],
        series: [
          {
            name: 'I 英国/波罗的海',
            type: 'line',
            data: data1[0],
          },
          {
            name: 'II 法国',
            type: 'line',
            data: data1[1],
          },
          {
            name: 'III 西班牙',
            type: 'line',
            data: data1[2],
          },
          {
            name: 'IV 美国',
            type: 'line',
            data: data1[3],
          },
          {
            name: 'V 巴西',
            type: 'line',
            data: data1[4],
          },
          {
            name: 'VI 阿根廷',
            type: 'line',
            data: data1[5],
          },
          {
            name: 'VII 南非',
            type: 'line',
            data: data1[6],
          },
          {
            name: 'VIII 印度',
            type: 'line',
            data: data1[7],
          },
          {
            name: 'IX 巴基斯坦',
            type: 'line',
            data: data1[8],
          },
          {
            name: 'X 澳大利亚',
            type: 'line',
            data: data1[9],
          },
          {
            name: 'XI 日本',
            type: 'line',
            data: data1[10],
          },
          {
            name: 'XII 美国',
            type: 'line',
            data: data1[11],
          },
          {
            name: 'XIII 俄罗斯',
            type: 'line',
            data: data1[12],
          },
          {
            name: 'XIV 新西兰',
            type: 'line',
            data: data1[13],
          },
          {
            name: 'XV 智利',
            type: 'line',
            data: data1[14],
          },
          {
            name: 'XVI 秘鲁',
            type: 'line',
            data: data1[15],
          },
          {
            name: '总体',
            type: 'line',
            data: data11,
          },
        ],
      }
      //清空画布,防止缓存
      myChart.clear()
      // 使用刚指定的配置项和数据显示图表。
      myChart.setOption(option)

      //根据窗口的大小变动图表 --- 重点
      window.onresize = function () {
        myChart.resize()
      }
    },
  },
}
</script>

<style lang="scss" scoped>
#main2 {
  width: 95%;
  height: 95%;
}
</style>
